** Molecule Geometry Optimization
#+BEGIN_SRC python
from ase import Atom, Atoms
from ase.data.molecules import molecule
from jasp import *

mol_name = 'CH3CONH2'

# Create the initial structure
mol1 =  molecule('{0}'.format(mol_name))
mol1.set_cell([10, 10, 10], scale_atoms=False)
mol1.center()

ready = True

emol=0

# Make a geometry optimized structure of a molecule and get the charge density
# Default calculations made with molecule at center of unit cell for better visualization
with jasp('molecules/{0}-center'.format(mol_name),
          xc='PBE',
          encut=350,#Energy cutoff
          ismear=0, #Smearing of orbitals
          ibrion=2, #Geometry optimization
          nsw=8,
          nbands=2*6 + 1*3 + 1*3 + 5*1 + 3,
          ispin=2,  #Spind polarization
          atoms=mol1) as calc:
    try:
        emol = mol1.get_potential_energy()
        fmol = mol1.get_forces()
        print calc
    except (VaspSubmitted, VaspQueued):
        ready = False

print emol
print fmol

#+END_SRC

#+RESULTS:
#+begin_example
: -----------------------------
  VASP calculation from /home/shubhadm/mini_project1/molecules/CO2-center
  converged: True
  Energy = -22.959585 eV

  Unit cell vectors (angstroms)
        x       y     z      length
  a0 [ 8.000  0.000  0.000] 8.000
  a1 [ 0.000  8.000  0.000] 8.000
  a2 [ 0.000  0.000  8.000] 8.000
  a,b,c,alpha,beta,gamma (deg): 8.000 8.000 8.000 90.0 90.0 90.0
  Unit cell volume = 512.000 Ang^3
  Stress (GPa):xx,   yy,    zz,    yz,    xz,    xy
            -14.918 -14.918 -13.096  0.000  0.000  0.000
 Atom#  sym       position [x,y,z]         tag  rmsForce constraints
   0    C   [4.000      4.000      4.000]   0   0.00      T T T
   1    O   [4.000      4.000      5.177]   0   0.00      T T T
   2    O   [4.000      4.000      2.823]   0   0.00      T T T
--------------------------------------------------
Spin polarized: Magnetic moment = 0.00

INCAR Parameters:
-----------------
         ispin: 2
        nbands: 26
        ismear: 0
           nsw: 8
        ibrion: 2
         encut: 350.0
        magmom: None
          prec: Normal
          kpts: [1, 1, 1]
    reciprocal: False
            xc: PBE
           txt: -
         gamma: False

Pseudopotentials used:
----------------------
C: potpaw_PBE/C/POTCAR (git-hash: 2272d6745da89a3d872983542cef1d18750fc952)
O: potpaw_PBE/O/POTCAR (git-hash: 9a0489b46120b0cad515d935f44b5fbe3a3b1dfa)
-22.959585
[[ 0.     0.     0.   ]
 [ 0.     0.    -0.002]
 [ 0.     0.     0.002]]
#+end_example
